export const MsgModel_mock = {
    "resultCode": "100",
    "detailDescription": null,
    "pageInfo": {
        "totalRecords": 100,
        "totalPage":10,
        "pageIndex": 3,
        "currentPage": 1
    },
    "resultContent":[
        {
            "id": "1",
            "content": "云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒云主机资源即将释放提醒!!!!!!!!!!!!!!",
            "createTime": "2016-11-17 00:50:09",
            "status": '1'
        },
        {
            "id": "2",
            "content": " 2016年10月账单已生成，请查收!!!!!!!!!!!!!!",
            "createTime": "2016-11-30 00:50:09",
            "status": '0'
        },
        {
            "id": "3",
            "content": "账单已生成，请查收!!!!!!!!!!!!!!",
            "createTime": "2016-01-02 00:50:09",
            "status": '1'
        },
        {
            "id": "4",
            "content": "云主机资源创建成功!!!!!!!!!!!!!!",
            "createTime": "2016-12-12 00:50:09",
            "status": '0'
        }
        ]
}